Revit API Introduction Labs
LabUtils.ElementDescription Method ()
 Return a description string for a given element.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static string ElementDescription(
	Element e
)
Visual Basic (Declaration)
Public Shared Function ElementDescription ( _
	e As Element _
) As String
Visual C++
public:
static String^ ElementDescription(
	Element^ e
)
Parameters
e
Type: Element
See Also
LabUtils Class
ElementDescription Overload
Labs Namespace